In [1]:
import pandas as pd

In [6]:
#Lista
data = [['Juan',25], ['María',30], ['Pedro',40]]
print (type(data))

<class 'list'>

In [10]:
df=pd.DataFrame(data,columns=['Nombre','Edad'])
df

  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    40

In [11]:
#Diccionario
data={'Nombre':['Juan','Maria','Pedro'],
      'Edad':[25,30,40]}
print (type(data))

<class 'dict'>

In [12]:
df=pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [20]:
#Tuplas
data=[('Juan',25),('Maria',30),('Pedro',40)]
print (type(data))

<class 'list'>

In [21]:
df=pd.DataFrame(data)
df

       0   1
0   Juan  25
1  Maria  30
2  Pedro  40

In [24]:
df=pd.read_csv('../data/data',sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [26]:
df=pd.read_csv('../data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [28]:
df=pd.read_csv('../data/data_without_header')
df

    Juan  25     Madrid
0  María  30  Barcelona
1  Pedro  35    Sevilla

In [29]:
df=pd.read_csv('../data/data_without_header',header=None,names=["nombre","edad","ciudad"])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [30]:
df=pd.read_json('../data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [31]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [32]:
df.head(2)

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [34]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [35]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [37]:
df.shape

(3, 3)

In [38]:
df['nombre']

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [39]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [44]:
df.loc[2]

nombre      Pedro
edad           35
ciudad    Sevilla
Name: 2, dtype: object

In [48]:
df.loc[[1,2]]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [50]:
df[df['edad']>30]

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [51]:
data={
    'grupo':['A','B','A','B','A','B'],
    'valor':[10,15,25,12,27,33]
}
df=pd.DataFrame(data)
df

  grupo  valor
0     A     10
1     B     15
2     A     25
3     B     12
4     A     27
5     B     33

In [52]:
df.groupby('grupo').mean()

           valor
grupo
A      20.666667
B      20.000000

In [54]:
df.groupby('grupo').sum()

       valor
grupo
A         62
B         60

In [55]:
df.groupby('grupo').count()

       valor
grupo
A          3
B          3

In [57]:
import numpy as np

In [59]:
data={
    'A':[1,2,np.nan,4],
    'B':[4,np.nan,5,7]
}
df=pd.DataFrame(data)
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [62]:
df_lleno=df.fillna(value=0)
df_lleno

     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  5.0
3  4.0  7.0

In [63]:
df_sin_na=df.dropna()
df_sin_na

     A    B
0  1.0  4.0
3  4.0  7.0

In [64]:
def suma(a,b):
    return a+b

In [65]:
df['suma']=df['A']+df['B']
df

     A    B  suma
0  1.0  4.0   5.0
1  2.0  NaN   NaN
2  NaN  5.0   NaN
3  4.0  7.0  11.0

In [66]:
df['suma']=df['A']*df['A']
df

     A    B  suma
0  1.0  4.0   1.0
1  2.0  NaN   4.0
2  NaN  5.0   NaN
3  4.0  7.0  16.0

In [67]:
def doble(x):
    return x*2

In [70]:
df['doble']=df['B'].apply(doble)
df

     A    B  suma  doble
0  1.0  4.0   1.0    8.0
1  2.0  NaN   4.0    NaN
2  NaN  5.0   NaN   10.0
3  4.0  7.0  16.0   14.0